# 파이썬
# 코드가 간결/가독성이 높음
# 데이터/머신러닝 분야 강세
# 웹 추천 - 파이썬, 자바스크립트

# 변수명은 숫자로 시작할 수 없다. (중간이나 끝에는 O)
# Type Hinting = age: int = 19
# 변수명(한글, 언더바, 영대소문자, 띄어쓰기 X)
# 변수명 = 가독성이 가장 중요
# 클래스네이밍(?)은 CamelCase방식 선호

# sum은 인자를 2개 받는다.

# 숫자타입 2가지
# 정수형 : int
# 실수형 : float

# 연산자
# +, -, *, /, 몫//, 나머지%, 지수승**
# ==, !=, <, <=, >, >=

# 문자열
# "hello" + "world" => hello world O
# "hello" * 10 => O , 10 * "hello" => X

# new line // 개행문자 => \n

# bool 판단 = 0, 비어있는 값 => F, 그 외 T
# bool(값) => T/F 판단 가능

# 참 and 참 = 참, 참 and 거짓 = 거짓, 거짓 and 참 = 거짓, 거짓 and 거짓 = 거짓
# 참 or 참 = 참, 참 or 거짓 = 참, 거짓 or 참 = 참, 거짓 or 거짓 = 거짓
# and = &&, or = || (다른 언어들)

# NameError!
# 정의되지 않은 변수에 접근했을 때, 참조할 때의 변수명 오타

# "역삼로" + str(31) = f"역삼로 {31}"

# If 그룹당 if : 처음 1회만 사용, elif : 0회 이상. 필요한 만큼 연속사용, else : 필요한경우 마지막 1회만.
# if 조건 1
#   만족하지 않을 시

# range => list (X)

# 반복문(lOOP Statement)
# for, while
# for = 목록 미리 구성 후 가져오고, 가져올 값 목록의 끝이 있다.
# while = 거짓에 도달할 수 없는 조건 지정 시 무한루프에 빠진다.
