# try / except = 쓸 때 : except keyError 라고 써주는 것이 좋다
# ["A", "B", "A"].count("A") = 카운트:리스트 안에 몇개 있는지 세어준다.
# try / except ValueError -> print("잘못된 값을 입력하셨습니다.") -> continue


# 튜플(tuple)
# 리스트와 유사하지만 변경 불가능한 특성
# 괄호 없이 콤마로 구분, 소괄호를 쓰기도 함
# "A", "B", "C", "D"     ("A", "B", "C", "D")
# 1, 2, 3 = 튜플, 1, 2 = 튜플, 1, = 튜플, 1= int
# [1, 2, 3] = 리스트, [1, 2] = 리스트, [1,] = 리스트, [1] = 리스트
# 튜플보다 리스트를 추천

# swap = 변수 두개의 값을 서로 바꾼다.

# set = 중복을 허용하지 않는 값들의 모음 : 중복값을 알아서 걸러준다.

# int ("10"), str(10), tuple([1, 2, 3]), list((1, 2, 3)), set([1, 2, 3, 1])
# 사전은 key/value가 있어야 한다.
# dict([
# ('k1', 'v1'),
# ('k2', 'v2'),
# ])

# 집합 = 중복을 없애고 싶을 때
