# 리스트
# 다수의 값들을 순서에 맞춰 저장할 수 있는 자료구조이며 저장된 순서를 그대로 유지한다
# append = 마지막에 더하기(1개만 가능) / insert = 원하는 곳에 끼워넣는다

# 인덱스/슬라이싱은 데이터 분석 할 때에 필수 = 원하는 범위의 데이터 찾기

# 한 리스트의 값을 여러 변수에 나눠 저장하기
# ch1, ch2 = "HE"
# ch1, ch2 = ("H", "E")
# ch1, ch2 = ("H", "E")
# items = ["아이유", "Zion. T", "양다일", "pH-1", "임창정", "로꼬", "바이브", "IKON"]
# 가수1, 가수2, 가수3, 가수4, 가수5, 가수6, 가수7, 가수8 = items -> 갯수를 맞추지 않으면 ValueError
# 가수1, 가수2, 가수3, 가수4 = items[:4]

# dict 사전
# 다수의 "Key:Value"쌍을 저장할 수 있는 자료 구조
# Key를 통해 각 Value들을 참조(리스트/튜플/집합은 값들의 모음 -> 각 값들은 인덱스를 통한 참조)
# 저장한 순서를 보장하지 않는다
